//
// Created by root on 10/12/18.
//

#ifndef CEPH_KVSSTORE_TYPES_H
#define CEPH_KVSSTORE_TYPES_H

#include <unistd.h>
#include <memory.h>

#include <atomic>
#include <mutex>
#include <vector>
#include <map>
#include <condition_variable>

#include <boost/intrusive/list.hpp>
#include <boost/intrusive/unordered_set.hpp>
#include <boost/intrusive/set.hpp>
#include <boost/functional/hash.hpp>
#include <boost/dynamic_bitset.hpp>

#include "include/ceph_assert.h"
#include "include/unordered_map.h"
#include "include/mempool.h"
//#include "include/memory.h"

#include "common/Finisher.h"
#include "common/RWLock.h"
#include "common/WorkQueue.h"
#include "common/Clock.h"
#include "os/ObjectStore.h"
#include "os/fs/FS.h"
#include "kvsstore_ondisk.h"
#include "kadi/kadi_types.h"
//#include "kvsstore_kadi.h"


#define KVS_OBJECT_MAX_SIZE 2*1024*1024
#define KVSSTORE_POOL_VALUE_SIZE 8192

enum constants {
	OMAP_KEY_MAX_SIZE = 241,
	COLL_NAME_MAX_SIZE = 250,
	MAX_BATCH_VALUE_SIZE = 8192
};
class KvsStore;
struct KvsOnodeSpace;

class KvsOpSequencer;
using OpSequencerRef = ceph::ref_t<KvsOpSequencer>;
//typedef boost::intrusive_ptr<KvsOpSequencer> OpSequencerRef;

struct KvsCollection;
typedef boost::intrusive_ptr<KvsCollection> CollectionRef;

enum {
    KVS_ONODE_CREATED        = -1,
    KVS_ONODE_FETCHING       =  0,
    KVS_ONODE_DOES_NOT_EXIST =  2,
    KVS_ONODE_PREFETCHED     =  3,
    KVS_ONODE_VALID          =  4
};

static const std::map<std::string, int> builtin_omapkeys = {
        {"snapper",  2},
        {"_info", 3},
        {"_", 4},
        {"snapset", 5},
        {"0000000007.00000000000000000001",6},
        {"_epoch", 7},
        {"_infover", 8},
        {"_biginfo", 9},
        {"may_include_deletes_in_missing", 10},
        {"_fastinfo", 11}
};

struct __attribute__((__packed__)) kvs_var_object_key
{
    uint32_t         grouphash;                    //4B
    uint8_t          group;                        //1B
    uint64_t         poolid;                       //8B 13
    int8_t           shardid;                      //1B 14
    uint8_t          spaceid;                     // KSID
    uint32_t         bitwisekey;                   //4B 18
    uint64_t         snapid;                       //8B 26
    uint64_t         genid;                        //8B 34
    char             name[1024];                   //221B - MAX SIZE is 217. set to 1024 to avoid possible buffer overflow during encoding
};

struct __attribute__((__packed__)) kvs_journal_key
{
    uint32_t         hash;
    uint8_t          group;
    uint64_t         index;                        // 8B
    uint8_t          reserved1;
    uint8_t          reserved2;
    uint8_t          reserved3;
};

struct __attribute__((__packed__)) kvs_coll_key
{
    uint32_t         hash;
    uint8_t          group;
    char             name[250];                      //15B
};

struct __attribute__((__packed__)) kvs_omap_key_header
{
    uint8_t  hdr;
    uint64_t lid;
};

struct __attribute__((__packed__)) kvs_omap_key
{
   uint32_t	     hash;
   uint8_t       group;
   uint64_t       lid;  // unique key
   uint8_t       isheader;  // unique key
   uint8_t       spaceid; //KSID
   char		     name[OMAP_KEY_MAX_SIZE];// 255-13B
};

struct __attribute__((__packed__)) kvs_omapheader_key
{
    uint32_t	  hash;     // 4
    uint8_t       group;    // 1
    uint64_t      lid;      // unique key       8  13 bytes
    uint8_t       reserved1;
    uint8_t       reserved2;
    uint8_t       reserved3;
};


struct __attribute__((__packed__)) kvs_sb_key
{
    uint32_t         prefix;                        //4B
    uint8_t          group;                         //1B
    char             name[11];                      //11B
};


class KvsMemPool {

public:
    static kv_key *Alloc_key(int keybuf_size = 256) {
        kv_key *key = (kv_key *)calloc(1, sizeof(kv_key));
        if (key ==0) ceph_assert("failed to allocate memory");
        key->key = alloc_memory(get_aligned_size(keybuf_size, 256));
        key->length = keybuf_size;
        return key;
    }

    static kv_value *Alloc_value(int valuesize = KVSSTORE_POOL_VALUE_SIZE, bool needfree = true)  {
        kv_value *value = (kv_value *)calloc(1, sizeof(kv_value));
        if (value ==0) ceph_assert("failed to allocate memory");
        if (needfree) {
            value->value  = alloc_memory(get_aligned_size(valuesize, 4096));
        }
        value->length = valuesize;
        value->needfree = (needfree)? 1:0;

        return value;
    }

    static inline int get_aligned_size(const int valuesize, const int align) {
        return ((valuesize + align -1 ) / align) * align;
    }

